FemDesign.RestrictedObject
Contains string restrictions used for property definitions.
Restrictions are defined by strusoft.xsd

FemDesign.RestrictedObject.NonZeroFdVector3d(FemDesign.Geometry.Vector3d)
Check if val is a non zero 3d vector.
val:
Returns:

FemDesign.RestrictedObject.NonZeroFdVector2d(FemDesign.Geometry.Vector2d)
Check if val is a non zero 2d vector.
val:
Returns: